In [ ]:
import pandas as pd
import numpy as np

**Reading** **data** **using** **PANDAS**

we will use pandas read_csv to open passenger details csv and write codes on it

In [ ]:
df = pd.DataFrame(pd.read_csv('/content/passenger details.csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape

(891, 12)

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
drop_col = df.isnull().sum()[df.isnull().sum()>=(35/100*df.shape[0])]
drop_col   #we are storing columns which have more than 35% of data missing

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
#we have to fill all the empty coloumns with the mean value of the column so we will use df.mean() do do so.
df.fillna(df.mean(), inplace = True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

Because embarked conatins string value we can see details of that columns seperately.

In [ ]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For null values we will fill null values with most common value in the column

In [ ]:
df['Embarked'].fillna('s',inplace = True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  familysize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
familysize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

In [ ]:
df['Alone'] = [0 if df['familysize'] [i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked  familysize  Alone
0            1         0       3  ...        S           1      0
1            2         1       1  ...        C           1      0
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           1      0
4            5         0       3  ...        S           0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['familysize'])['Survived'].mean()

familysize
0     0.303538
1     0.552795
2     0.578431
3     0.724138
4     0.200000
5     0.136364
6     0.333333
7     0.000000
10    0.000000
Name: Survived, dtype: float64

In [ ]:
df['Sex'] = [0 if df['Sex'][i] == 'male' else 1 for i in df.index] # 1 for female 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

Female passengers have more chances of survival

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
s    1.000000
Name: Survived, dtype: float64

**CONCLUSION**

* People how are alone have less chances of survival.
* Female passenger were given more priority over men thus their survival  rate was high.
* Rich and higher class people were given priority.
* Passenger boarded at cherbourg have a higher rate of survival.